Code file   SuggestionWriting.md
##素材积累
1. ……

2. Q: 如何更好地利用卡片写作？

> 阳老课上提到卡片式写作，我的理解是先把一个个小的点用卡片的方式分别写出来，最后就像搭积木一样，把这些卡片拼在一起。但是我在写作过程中会这样：就是开始动笔之前，对于文章的整个脉络和行文逻辑都会提前有个规划，开头写什么？中间应该写哪些东西？结尾如何结？这些大概心里都会有个谱，然后从头到尾这样写下来。这样写思路还比较清楚，但很有可能会固化文章，缺乏一些偶然的创造和火花。对于这个问题，大家有什么看法？需要做哪些修改？

> 在使用卡片写文章的时候，发现自己写的卡片常常风格不统一、人称不统一、主题不统一，拼接成一篇文章，感觉会很别扭。是不是自己用卡片的方式有些不对呢？

A：我个人建议，大家平时把一些灵感记到自己的记事本或卡片系统里，未来你不知道在什么时候会用上，你可以用一个带全文搜索的资料管理工具。卡片不是用来拼接文章的，而是用来记录平时的想法，当你真正进入快速写作的时候，可以随时调用原来的资料。

比如知名的科幻作家，陈楸帆老师吧！他提到过，他正常写科幻小说的速度非常快，但也有写得慢的时候。那么陈楸帆老师怎样来处理平时写得比较慢的时候呢？这个时候他会积累一些素材，他当时在开智社群的讲座中提到，认为是他的大脑后台在默默工作处理这些信息，其实不仅仅是陈楸帆老师利用这种工作机制，在第四周的视频中，咱们给大家讲了三位一流的作家，他们都是这种工作方法：平时用卡片积累了大量素材，未来写文章时变着角度去使用，比如他写一个咖啡馆的情景，大概是有两三百字，在这篇文章中他写的不是咖啡馆是图书馆，那么他会把咖啡馆相应的词汇替换成图书馆，这样三百字很快就拼接完了。

你平时积累很多卡片，突然有一天你就有了强烈的冲动，这时候就赶紧去写。在真正写作的时候，你是按照自己的思路快速地写，这个时候你不用想太多，逻辑不用提前去规范，你这个时候规范得越清晰，算法心智这部分就都用得越多，文章写着写着就是越来越干巴巴，越写越不想写，绝大多数写作的拖延症其实都是这样诞生的。当你的写作大纲越详细的时候，你的写作是否拖延得就会越严重？一般来讲就是写作大纲建议不要写得太详细了，写得更感性一些，这样才不至于让你自己对这个事情有很啰嗦的想法，就是你写着写着就越写越投入了。

村上村树的写作方法也是基于卡片的写作，他用的写作软件叫Scrivener——一个基于卡片写作原理设计的软件。

##修改
1. ……

2. Q：可否举例演示如何修改文章？

A：直接用同学的作业来举例。

####例一 [我的小传](https://github.com/zoejane/BookWriter002/blob/f4519bcbdcc00021673fb91de9ba98241dc24a36/chapter03/assignment.md) @ zoejane

#####i. 利用写匠检查，让文章简洁，删掉陈词滥调。
（说明一下，需要忽略写匠对“第一”的标注，这是主要是广告法决定的。备注：可查找广告法禁用词汇。）
* 使用**记忆生存优势**相关词汇。 「对我来说音乐是跳动的，是什么什么……」此处可利用记忆的是生存优势原理，使用比如说是大海、星空、沙漠还有水、食物一类词汇。
* 运用**时空变形法则**， 还可以使用不太熟悉的比喻用来产生新意，「音乐是食物」是熟悉的，可以加上一个时空变形，比如说是「音乐是一整个大海的什么什么，是一个城市的什么什么」。
* **4X5原理**运用，文章中「打开音箱，练习，即兴，实验，演奏，扒歌，写歌」，此处违背4X5原理，且未创造踌躇（颠覆4X5原理的技巧，第六讲会提到）的感觉，精简为佳。一流作家，词汇超过四个以上，会变换一种句式，四个字变成六个字，加分号来变动。
* 使用多样化词汇， 比如说「听」，她使用了五次，但是「听」可以用更有细节感，更形象的词汇来替换。
* 二级小标题应该删除，自己清楚即可；在短文之中，它会割裂**文气**。

#####ii. 使句式清晰，用空间结构来组织全文

文章10个段落，1237个字，用时间结构来描述，此处尝试空间结构重组，让主线清晰、更容易唤醒记忆，

由打口CD店切入，多年后我又在这一个打口CD店，可以写的更有动作，比如说他迈入这个CD店依然是当年怎么样，还可以和他老板的一个对话，以及这一个CD店，它是处在一个什么样的空间范围内，它的这个街内和街外各有一些什么，再依次的介绍他当年喜欢音乐做出的一些狂热的行为，如此，可以从这个CD店自如的跳到当年的空间。

另一个地点是排练房间或草地，草地符合记忆生存优势效应，是好意象。CD店开头，再是他到排练的房间，再从排练的房间切换回到这个CD店。也可以草地到排练房再到草地。

用空间结构，有助于唤醒记忆。咱们再看一下它的这个结尾，「我希望我的人生是自由的，音乐精力满怀着热诚，满怀着爱与好奇」这一个结尾难以唤醒好奇心和同理心。若改成空间结构，绝大多数人都在学校草地、打口CD店以及排练房留下了自己的记忆，容易唤醒读者记忆，这是空间结构的先天优势。

#####iii. 连环暗示而非解释

你可以暗示躁动不安的青春与热血，而非直接点出。比如描写古惑仔的音乐和海报等。

前面提到了是叫打口CD店，到了这个地方，就是你可以拿CD店老板熟悉的一个乐队结尾，或用一句歌词结尾。歌词表达同样的意思，更含蓄一些，更隐讳。

####例二 [我的小传](https://github.com/Lyxn/BookWriter002/blob/62df96ef219be6028245ee1bd727877827851860/chapter03/assignment.md) @Lyxn

#####用空间结构改良文章

选择好的空间结构。文章中游戏，挑战和代码出现次数多，考虑梦境空间或游戏空间为主线。

他可以模拟自己是一个游戏开发者，他是游戏空间的制造者，一个全知全能的视角，让游戏空间和他自己的生活空间交错。这样的话，他这篇文章一改完之后就会改得非常有趣和非常有意思了。

当然他现在这篇文章也是写得非常好的，只是假如说要让他更像是一篇小说或者更像是一篇故事，我建议这位同学可以这么去改一下。现在这篇文章，它的逻辑是没有问题的，文采是没有问题的，稍微弱一点的是它的故事性，用这样一种方法，可能提高它的故事性。

颠覆常见空间感觉。游戏空间=玩游戏，这是习惯思维套路，。

####例三 安静的咖啡馆 @xiaojingli李晓静

> 梧桐树掩映着古旧的咖啡馆，人群散尽后，咖啡悠闲的香气还袅袅不肯离去，陪着他在留在馆里。他一边看着窗外雨点一滴一滴地敲在落叶上，一边听着CD机里传出钢琴声，像是月光清澈的声音，温柔地洒在每个角落。

主题是写一个「安静的咖啡馆」，把这个主题给屏蔽掉，替换问题，如何表现咖啡馆的安静，转化为，怎么在不出现咖啡馆三个字的情况下，表现咖啡馆的安静？

挑选大脑中先天和安静联系紧密的意象，聚焦到一个画面上，产生一系列暗示。梧桐树是好意象，她应该展开，更具象一些，至少四句话以上。而非雨有自己的形象，落叶有自己的形象，CD有自己的形象，钢琴有自己的形象，咖啡的香气有自己的形象。

加上时空结构。五道口的梧桐树安静不下来，而朝阳区三里屯的梧桐树可以。给读者纵深感，梧桐树是在三里屯的一个比如XX街靠里，让人想象自己是沿着长而安静的一个林荫大道走着。

用跟这个咖啡馆没关系的，跟它发生关系，这就是以一个空间内外的一个切换。接下来是再用一些细节把落叶这一部分挪到梧桐树的这个描述上，就是你不要切换到这个咖啡馆的馆内，你依然是在写咖啡馆馆外。

故事情节，切合主题。安静有了，催眠成功了，但和主题不搭调。此处可用有文采的写法，利用咱们反复提到的——空间内外切换，如张爱玲《白玫瑰和红玫瑰》身体从衣服里蹦出来，就是人本来应该是坐在咖啡馆里面的，而你写咖啡馆外。你可以用一个类似的比喻，这一个类似的比喻就是你可以设计一个有一点点故事情节，比如说是一个男孩和一个女孩吵架，是一个女孩在想念一个男孩，就类似的这种情节。这样你一下子就把整个文章激活了，你依然是没有出现咖啡馆，但是所有人都知道这是一个安静的咖啡馆，是一个咖啡馆的故事。

-----------------------------------------------------------------------------------------------------------------------------
Code File  Writer002/QA/3w.md

#课程内容探讨
##关于网络科学与神经元网络

Q1：既然普通人大脑呈现小世界网络的特点，那么为何不只是从小世界网络的原理推理出一些原则，而也从随机网络和无标度网络原理推演出其他两个基础原则，这也就意味着大脑的神经网络也有随机网络的特征和无标度网络的特征吗？（后面有研究显示大脑呈现随机网络的更多的是精神病。这是否矛盾？如何理解呢？）

A: 第一个问题我先简单地给大家解释一下，这三个网络一个是小世界网络，一个是无标度网络，一个是随机网络，它们之间都可以用同样的数学公式统一到一起。这一个工作是一位朋友，他是在今年刚刚发表的一篇论文，是叫周涛，也是中国一位非常先进的网络科学家。

接下来再具体地讲一下小世界网络、随机网络和无标度网络，它们的侧重点不太一样。小世界网络侧重的是网络的一个模块性。随机网络本身它侧重的是它的一个学习性导致的泊松分布，这是它最大的特点。无标度网络更多侧重的是它的一个HUB节点，更多的侧重网络的连通性。 这三个网络在网络科学中侧重点不太一样，也是由不同的科学家作出的贡献。

大脑成像为随机网络的更多的是精神病，确实是这么回事。前几天我的一个好朋友，大家都知道的一位知名的脑科学家，他准备研究某一些脑残粉，就是是说是看一下他的随机网络会怎么样。他推算出一个脑残粉的随机网络和正常人的随机网络的连通性会有一些不一样。确实是这么回事，就是精神病人的他的大脑的连通性和他的各项指标更偏随机网络。

Q2：从随机网络到大脑喜欢惊奇的逻辑关系如何理解？

> a.随机网络原理
> 
> b.大脑神经元网络更加容易被新奇的刺激所抓住
> 
> c.所以大脑更加喜欢惊奇。
> 
> 由b到c非常好理解，但是由a到b是如何推演的？

A: 简单地来讲这位同学理解非常的对，由B到C非常好理解，由A到B的推理其实是比较勉强的。

咱们打一个简单的比喻，比如说我要生成一个固定结点数，这个网络的每一个结点都拥有三个联接，这是正则网络。接下来生成一个随机网络，这个随机网络的随机性我用N表示。这个N它会产生不同的一个分布，最终它的分布会符合一个泊松分布。

通过这一个分布，它可以产生一定的规律性，这一点就是它的一个原理，当然这么解释其实还有一点勉强。它其实有更好的解释。大脑喜欢惊奇这一个词汇其实使用得不太恰当，惊奇这个词它是带有一个情绪色彩，其实要把它改为叫新意这个词汇好一些。

怎么来证明这一个结论呢？就是在一个随机网络中不断地插入一些新意刺激，最后看这一个大脑的网络是趋向于是小世界网络还是趋向于随机网络，这是一种证明的方法。同样的还有第二种、第三种证明的方法，就是你在一个随机网络中插入更多的新意刺激和新意结点，最终你会发现这个结点达到了一定的程度，它会越来越趋向于一种新的布局和一种新的连通性，这跟它插入的新意结点有关，当随机网络插入的新意结点达到了一定的量级，最终就形成了人脑，咱们人脑的小世界网络就是这么来的。

这么一说，大家有可能有一些理解了。我再通俗地打一个比喻，这个比喻其实不太准确，但能帮助大家理解，比如说小世界网络说的是一个班级，60个同学，这60个同学会分成是10个左右的小团队，是这种现象。

那么就是说随机网络说的是一个什么样的现象呢？为什么说这一个是班级喜欢新意刺激？就是这个班级刚开始的时候是60人，它从60人涨到600人，也要不
断地去插入各种各样的新意结点，最终你插入新意结点，插入到一定程度，依然会分发成各种各样的小世界、小群体。

无标度网络，咱们依然用这一个班级的比喻，无标度网络说的是这么一回事，当这个班级它只有这一个60个人的时候，和它是600人的时候，和它是6万人和6亿人的时候，它不同尺度上，它都会网络结构呈现出一些共性的规律，这些规律大家最熟悉的就是二八法则。

Q3:网络科学的三大基本原理之间的关系是怎样的呢？

> 小世界网络，随机网络，无标度网络。这三个网络是人们普遍观察到的现象，这几个现象之间有什么关联吗？

A：周涛用一个数学公式将三个网络之间的关系进行了阐述，下面是他的论文：

*[TheH-index of a network node and its relation to degree and coreness](http://polymer.bu.edu/hes/articles/lzzs16.pdf)* 

*[Toward link predictability of complex networks](http://doc.rero.ch/record/235710/files/zha_tlp_sm.pdf)*

Q4：既然《多者异也》说不同的尺度有不同的规律，那么网络科学的普遍适用性又是由什么规律决定的呢？

A: 网络科学的普遍适应性是由什么规律决定的？简单说网络科学和一般的科学不太一样，是非决定论的思维方式。比如说心理学的非网络科学的研究思路吧，比如说一个人的学习动机是由ABCD四个变量决定，然后对它是建立一个结构方阵模型，这是传统的心理学研究的思路。 网络科学有一个非常经典的比喻，拿这一个国家打比喻，什么样叫网络科学的观点？什么不是网络科学的观点？你把一个世界分成发展中国家和发达国家，这一个就是属于叫非网络科学的观点，你把一个世界分成中心国家和边陲国家，这就是网络科学的观点。

这一些观点具体来讲有五个原则，我在群里面发一篇我的论文——《[社会网络分析在社会心理学中的应用](http://www.anren.cn/research/articls/shehuiwangluofenxizaishehuixinlixuezhongdeyingyong)》，这一篇论文里面把这五个原则总结了一下，大概是我十多年前发表的一篇论文。

大家可以发现网络科学更多地关注的是一个结构，而不是一个因果关系，所以说它为什么是21世纪最重要的学科？因为它带来了一个思维方式的变革。这一块我要特别特别提醒大家一点，把网络科学和这一个因果推论结合在一起，有一个图灵奖得主，写了一本非常精彩的书，这一本书也可能对大家未来的工作，尤其是群里面从事的是机器学习这一块的同事会帮助非常大。书名是*[social network analysis](https://book.douban.com/subject/1889768/)*

Q5：三个网络能否相互转化？

> 这个问题源于对于网络科学的陌生。网络科学是研究复杂性现象采用的抽象视角。是一种数学模型。复杂性网络一般呈现的就是这样几种分布特征，小世界，随机，无标度。他们之间在某些条件下可以转化？网络科学的普遍性是由数学规律决定的。

A：它是完全都可以相互转化的，给大家推荐一本书——《[网络科学引论](https://book.douban.com/subject/25970086/)》，这一本书是业界公论是写得最好的一本网络科学的书，是2011年图灵奖得主写的一本书。有很多模型和很多指标都是他发明的。 
####神经美学
Q: 能否提供一些认知科学和美的资料？

A：神经科学中有一个独立的学科叫神经美学，这一块的研究成果其实非常的多，刚开始的时候对这个领域不太了解，可以看看科学美国人的科普吧！

对美感感兴趣的朋友还可以读读这篇论文：The experience of mathematical beauty and its neural correlates。论文找了16位数学家，来研究他们心目中最美的数学方程式，再看他们的大脑活动区域特征。目前神经美学的普遍发现是mOFC这个传统与情绪判断的脑区，关联美感。

如果对音乐方面的美感研究感兴趣的话，还可以看看 Daniel Levitin的 This is Your Brain on Music, 很有趣的一本书。推荐给所有爱音乐的书友。

这种美感共性不仅体现在人类相貌体征。在艺术上也同样。Denis Dutton写过一本 The Art Instinct, 总结了一些研究，认为几乎所有社会都更喜欢辽阔静谧的风景画(open spaces with lush vegetation and water, roads, non-threatening animals, a few people).


http://www.cell.com/trends/cognitive-sciences/abstract/S1364-6613(14)00075-8

##大脑喜欢模式
Q：在「大脑喜欢模式」中提到了「逆向利用空间/时间/时空的模式识别」，这个「逆向」该怎么理解呢？
> 大脑喜欢模式，人类大脑喜欢寻找前因后果，寻找模式，试图主观脑补世界的客观规律。模式也就是联系。大脑喜欢把一些事物联系在一起，进行整体认知和考虑。一种不自主的表现就是「脑补」。
> 具体落到写作上，是「逆向利用空间/时间/时空的模式识别」，不太理解「逆向」的概念，与之相对的「正向」又是什么样的呢？

A：你可以试着统计一下古代诗歌和现代文章中的例子，按照时间和空间纬度，运用夸张的手法，普遍容易把空间比喻的很小、时间比喻的很快，比如说鲁迅的《一件小事》开头——「一转眼我来北京城就六年了」。这就是一个时空模式。这种时空模式是可以被颠覆的。超一流的作家就在颠覆这种常见的模因，创建自己的模因。这就是强调的**时空变形**原理。

第五讲、第六讲总结了时空变形的公式——你在任何一个词汇上加上一个空间词汇，它就产生了远距联想，产生了新鲜感。比如描写爱情，张爱玲用倾「城」之恋；钱钟书他在《围城》中写女主人公对男主人公厌倦——「打了一方寸的呵欠」，亮点在「一方寸」。「我对你的爱如同整个朝阳区一样大」，比「爱你一万年」要好。

一个小小的文字游戏，一下子让人产生远距联想，这是利用人类的一个思维盲区。

##大脑喜欢情绪
####情绪分类和复合情绪

> 阳老师讲座中提到正向情绪和负向情绪，激发了我的一个联想。因为我前一段时间为了纠正孩子们的情绪反应，特意和孩子们一起看了好莱坞的《头脑特工队》。这引发了3个小问题。

Q1： 情绪的二分法是否合理？
> 阳老师谈到的正向情绪和负向情绪。我觉得一本书如果是写一个倒霉到底的人的故事（幸福来敲门）也不会特别激发人的同情吧。我反正那个时候看就感觉不忍心继续看下去。而一个始终不断快乐的人的故事其实也蛮让人觉得厌倦的。因为这是我自己的情绪的反映，不知其他人的想法。感觉中国人的传统中庸之道比二分法更适合情绪分类和不同情绪对人的感发，就像有人写”怨无大小，生于所爱，物无美恶，过则成灾”。不知道阳老师对此的评价。


A：情绪的二分法，它只是一个近式的分类方法，是科学家便于自己研究的一个定义，比如基本情绪和复合情绪，还有这一个积极情绪和消极情绪，但是大家一定要注意近似解比最优解更好，同时心理学绝大多数概念是一个波谱的概念，是一个刻度尺的概念，它并不是一个物理学的概念。比如积极情绪和消极情绪有时候就不能完全区分开，但是基本情绪和复合情绪它是能区分开的。小朋友刚开始出生的时候是没有这个复合情绪，他是在他出生之后快速的通过各种各样的学习在发展自己的复合情绪。

Q2：复合情绪如何分辨？

> 头脑特工队里只描写了5个情绪小人。有意思的是正向的joy和负向的sadness融合的时候，这种既难过又喜悦的心情难以形容。阳老师在讲座中画了一个图，复合情绪轮盘。用不同的颜色做成色谱来描述复合情绪。我的感觉是，如果正向的来看两个情绪混合，似乎很容易辨别，但是反过来就有些难了。比如一个事件，触发了若干紧张、激动、缺乏行动、没法决策、事后后悔等等因素，如何用复合的情绪来表达。这个分辨行为是否有意义？


A：第二个问题是复合情绪如何分辨？其中就是有几个很有意思的，就是发展心理学的研究和儿童心理学的研究，可以给大家简单的介绍一下，小孩刚出生的时候，有一个是叫社会性微笑的现象，社会性微笑就是即使不是他的爸爸和妈妈，他也会笑，这就是一个很有意思的现象；另外还有一个现象就是小朋友学会撒谎，就是属于他心智、能力发育的一种表现，这个时候他的复杂情绪开始出现了，并且他是会产生内疚一些心理。

Q3：情绪抽离如何理解？

> 在我给孩子们看了《头脑特工队》之后，一旦孩子哭，我就说，sadness快走开，joy快回来。孩子的反应就很快停止不哭了。我自己也有发现，一旦在情绪之中，强迫自己从情绪中抽离，以局外人的身份来观察自己的情绪反应，似乎就脱离了控制。情绪的力量也就没有那么大了。这种算进化吗？阳老师不是说过，情绪是人类进化习得的保护力量。情绪抽离能算在反省心智里还是自主心智里呢？这种模式是不是不应该过多的用在写作中。因为它不能引起情绪反应。


A:情绪抽离，《超越智商》有一章提到这个问题，他讲的非常好，就是有一个著名脑科学专家达马西奥，他写的一本书《笛卡尔的错误》，这本书中它是情绪脑的创始人，他提出了一种现象叫斯波克问题，就是一个人他没有情绪会怎么样？然后斯坦洛维奇就把它整合到自己的三种心智的概念中，大家可以看一下![这个图](http://7xso79.com1.z0.glb.clouddn.com/image%2Fpngthreeminds.jpg)



一般来说，基本情绪是隶属于自主心智，复合情绪隶属于反省心智和算法心智，但是这一个观点现在在认知科学界还存在争议。今年1月份的时候有一个同事和我争这个问题争了很久，后来我给他找到了一篇论文，是斯坦洛维奇写的一篇论文，目前就是斯坦洛维奇他采取了这个观念。其他有的认知科学家可能不太同意这个观念，这是现在学术界还有争议的一个观念，就是基本情绪和复合情绪和人类的这一个大脑网络，究竟是一个什么样的关联？咱们暂时采取这种对应关系，就是叫基本情绪隶属于自主心智，复合情绪更多的是隶属于是算法心智，反省心智。

####记忆生存优势效应

Q：记忆生存优势效应和故事是什么关系？故事是情绪的载体么？

A：对于「记忆生存优势效应」，认知科学家一般采用这样的研究实验范式，给被试不同材料，这些材料一般是词语或图画，看被试对哪些材料记忆得更容易，结果发现被试对进化早期的那5大类记忆起来更容易，对进化晚期的材料，比如城市等，相对来说记忆得更困难些。这是记忆生存优势效应的研究手段和发现的一个结论。

那么它和故事是什么关系呢？其实，严格来讲，两者之间是没有关系的，只是大家都很明白，人类绝大多数时候以**故事**的方式存储各种各样的信息。在认知科学中区分了两种记忆，一种是偏情节的记忆，一种是偏语义的记忆，相对来说，偏情节的记忆，绝大多数是以故事形式存储的，这样会导致一种小小的关联，更符合记忆生存优势效应的故事，人类更容易记忆。

所以说我的一位同事做了这样的工作，为了帮助儿童更高效地记忆各种各样的东西，他结合记忆的生存优势效应，编了100多个故事，这种小故事又符合最小故事法则，那么小朋友通过这种学习方法，能够快速掌握大量的字和相应的故事。

故事和情绪也不是一回事。在认知科学中，一般这样划分：知、情、意，就是认知、情绪、意识，绝大多数时候是把认知和情绪当作两个独立系统，只是我刚刚前面介绍了人的记忆系统有两大类，这两大类也是跟情绪相关的，所以说大家会发现，有一些童年不幸的人，往往会给自己编出一些创伤记忆，比如他认为自己受到过谁谁谁的虐待，认知科学家发现这种记忆是虚假的、不存在的。

**记忆**是一个非常复杂的研究话题，也是认知科学研究的皇冠，感兴趣的同学可以看几本书，从去年开始，记忆这块有几本特别好的书都被引入到国内了，是非常好的科普，是后浪文化引入的科普，[记忆的风景](https://book.douban.com/subject/25885205/)，非常不错。假如大家要看教材的话，可以看华东师大杨治良写的一本记忆的教材——[记忆心理学](https://book.douban.com/subject/10864140/)，写得也不错。

##大脑是个吝啬鬼
####关于认知负荷理论

> Q：认知负荷为工作记忆中消耗的心理能量，分为内在、外在、相关的认知负荷理论 认知负荷理论是认知资源的分配，决定着工作效率。那么在现实中如何减少内在认知负荷、降低外在认知负荷、增加相关认知负荷来提高工作效率？尤其是如何增加相关的认知负荷？

A：内在的就是认知负荷更多的是你本身理解这一个概念，动用的就是认知负荷。外在的就是跟它相关的一些词汇，比如你要理解认知写作学，你不得不去明白修辞学这一些知识。但是你之前就有修辞学背景，那么你消耗的认知负荷非常低。外在的相关的就是指的是很跟环境、教学设计一些相关。比如说你这一次拿写作课来举例吧，Github和Markdown就是一个相关的认知负荷。

你要了解自己的认知负荷限度。认知负荷确实是是21世纪知识工作者越来越“重”的一个特点，今年1月份在深圳的时候，当时在开智沙龙我提出一个观念，这个观念大家有可能需要注意，就是在21世纪的任何工作可以分成一个2乘2的象限，是叫体力劳动和脑力劳动，就是绝大多数人以为自己能胜任叫重度脑力劳动，就是相当于以为自己能胜任认知负荷非常大的工作，比如说是在这一次写作课开课之前，估计很多同学以为自己听写作课都会很轻松，但是到了第三课，估计很少有同学敢这么说了。这是咱们人类的一个容易高估自己的特点。

绝大多数人会高估自己的胜任脑力劳动的能力，这非常容易引发心理崩溃，也是为什么现在心理疾病越来越流行的一个原因：绝大多数人是在从事重度体力劳动再加重度脑力劳动，这样的话，他不崩溃才怪，咱们人类习惯的就是工作方式是叫轻度的脑力劳动加中度的体力劳动，这是人类习惯的不太容易产生身体健康和心理健康的一种工作方式。

下面是一些可以**降低认知负荷**的小技巧

* 元认知：积累不断可以复用的模式

源头就是不断复用的模式，这就是认知科学的元认知给大家的启发。这种元认知在所有的学科中可以复用，这样的话就是能降低你的认知负荷。

* 使用专业工具

绝大多数专业工具，已经隐含了很多模式和降低你认知负荷的设计。如Github，它已经隐含了很多一流程序员的工作习惯，这种工作习惯，你刚开始的时候特别不适应，但是当你适应的时候你就越来越明白它的好处了。

* 有意识训练自己大批量信息处理能力

还有一个降低认知负荷的建议，大家可以有意识地训练自己大批量信息处理的能力。像我的同事刚来安人心智旗下工作的时候，都特别的崩溃，就是基本上第一周和前三个月是处在一个崩溃的局面，因为他们每天接受的信息量太大了。当时为什么过了一阵之后，他们的信息处理速度就会上升很多呢？就是因为这个时候他已经习惯一些技巧和原则了。

* 用树形结构来组织知识

还有一种原则具体来讲，比如知识管理的一些窍门:用树型结构来整理自己的知识，再比如说用维基，还有比如说是用5W1H，还有就是咱们上一节课答疑的时候反复提到过的必要难度理论。这一种方法习惯之后，你会发现你自己的知识管理的确在上升。

Q：在教学中如何善用认知负荷理论来提高教学效果？

> 阳老师说教学设计中善用认知负荷提高教学效果，真实课堂中每个同学认知负荷不同，如何利用认知负荷来设计教学？

A：绝大多数大家以为有效的方法，比如说是记重点，还有比如说是思维导图，但这种方法其实几乎得不到实验证据的支持，反而是大家意识不到的一些方法吧，它们得到了实验证据更多的支持，比如说：

* 已知信息和未知信息比例分配恰当

最简单的方法，可以做一个前猜后测，了解一下已知信息和未知信息，在人类的在任何一个认知操作的时候，已知信息和未知信息最好不要超过30%，阳老师的课是一个特例，因为我的时间太紧张了，我的课是一个特例，我的课认知负荷是非常大的。一般地来讲就是说是正常的教学设计是未知设计不要超过30%，已知信息要在60%以上，这是一个研究统计的一个比例，这是针对的是正常的教学设计。

假如说你的设计偏重大利益或者是一个非常关键的一个教学设计，比如商业计划书，这个未知信息，最好降到10%左右，这是当时一期写作课上给大家讲过的一个研究成果。就有科学家统计过已知和未知信息的一个最佳比例。

* 交叉教学法

除了这一种比例之外，另一个降低认知负荷的方法，是必要难度理论。传统的学习方法它是一个什么样的方法？比如说是我要学习打网球和打羽毛球，传统的学习打球的方法就是教练把这一个具体的技能先教完你A，你学会A了，再来教你B，这是传统的学习方法。但是认知科学近五年和近十年，已经用大量的实验证明了这一种学习方法是极其低效的，就是说是叫AAAAA，BBBBB，CCCC，这种序列的方法是非常低效的。分散学习它就是一个教练同时比如说是你打球要学ABCD四个技能，它是同时ABCD、ABCD、ABCD这种教你，这种是更高效的。

* 测试效应和闪卡

其中有一个大家不太注意的方法，叫测试效应和闪卡。测试效应非常普遍，这一块的研究已经非常非常多了，测试能够帮助大家更好地提高学习。

【参考资料】： 

**元认知与记忆**
* Ucla Bjork Learning and Forgetting Lab：解决了长时记忆的很多困惑，并颠覆了传统学习观念。值得重点关注。一个通俗的介绍可以参考：Everything You Thought You Knew About Learning Is Wrong 
* 普渡大学的认知与学习实验室：年轻学者Jeffrey D. Karpicke打头，解决了艾宾浩斯曲线隐藏的一个大问题，从Recall到Retrieval。

** 学习微观经济学**
* 哥伦比亚大学元认知实验室:研究Metacognition of Agency 值得重点关注 
* 肯特州立大学元认知与记忆实验室，打头的是：John Dunlosky。还是这个肯特州立大学，另一个实验室：理解与记忆实验室
*  asbenjam实验室，主要研究记忆技能、再认记忆、 元认知和记忆 、老化和记忆、面孔记忆。打头的牛是：asbenjam

via元认知和记忆实验室的网址：http://www.yangzhiping.com/info/resources.html


Q：多学科交叉教学的益处？

> 为什么要采取多学科同时介绍的方式来讲解？我们现在看到多个不同的术语其实术语多个不同的学科。这些学科时间发展次序不同，概念之间互有交错。比如立体几何，一般说来会在平面几何教完才会学习。如果不是这么严格对照的学术分支，则拓扑和复变函数，则会分别讲解，而不会同时介绍两者之间有哪些概念的含义可能有相通的地方。又比如学历史，当年我们学习时，中国历史和世界历史是两门课。现在据说是讲国内和世界同时发生的事情。这种教授方式有什么已知的好处证明？

A:前面提到了叫分散学习的好处，就是ABCD，ABCD这种学习比AAA、BBB、CCC的学习更好，同时这个地方还要提到一点关于创造力的研究吧！它已经普遍证明了一个观点，就是说创造力是一种即兴演奏以及是用不同的学科的就是思维联系在一起，这样的话更容易产生创造力，就是其实它是把创造力分成5个层级，就是ABC这三个层级更类似于是咱们现在所说的微创新，是在同一个系统内进行一些元素的组合，到了第四层级和第五层级，更多的是通过一个跨系统，比如说是把物理学的思路搬到化学上，把这个心理学的思路搬到社会学上，它在心理学上验证的一些结果应该在社会学上也会验证一些结果，这也是芒格所推崇的一种学习的思路。####阅读的马太效应

Q：阅读的马太效应，是不是一个定论？

A：已经有定论，这个研究恰巧是斯坦洛维奇做的。非常经典，叫关于阅读的马太效应。斯坦洛维奇大家都知道，他是心理学家，他的论文被引用是排在前二十名，他这篇论文就是被引用了1万多次。这已经是认知科学已经有定论的一个知识点，只是这个知识点绝大多数国内的从事儿童教育的和很多当爸妈的不知道，所以说国内的人经常有一个误区，认为不要给孩子过早地识字，并且他们是怎么来理解这一个误区的呢？国内的这一些人，他会强调一点，儿童早期会给他更多的图象思维会好一些，不要让孩子过早地学文字，这个压根是胡说八道，因为绝大多数文字本身其实已经带了图象思维了，这是国内包括无数儿童教育专家经常踩的一个坑吧，你可以故意问他，假如这个问题他能答对，他肯定是一流的儿童教育专家，这个绝大多数儿童教育专家会答错。这一个问题，我在微博上个人讲过，所说我对这个问题很熟悉。

---------------------------------------------------------------------------------------------------

Code file Writer002/SuggestionLearningStyle.md

#学习习惯建议

7. Q：如何筛选图书？

> 按老师的“全脑网络”讲法，《全新思维》（作者丹尼·平克）的理论基础是错误的？书中讲到“我们在从信息时代进入概念时代”（作者给出的一个情景前提）那么在一个不太靠谱的理论基础上（左、右脑思维），书中提到的六种能力“设计感、故事力、交响能力、共情能力、娱乐感、探寻意义”存在一定参考意义，是吗？我看这6个能力都倾向于三类智者中的“讲故事的人”。

A：作者丹尼·平克，作为一名专门的心理学科普的畅销书作家，在基础理论上出了错。他在一个错误的理论基础上又提出了六种能力，一路错下来；并且他不是一次这么错，他在他的三本畅销书中全都这么错过。所以说这就是为什么要突出时间源头的概念。假如你依据一个错误的理论，就会一路错下来。

大家一定要养成看一手论文的习惯。绝大多数科普书其实都是浪费时间，除非是十年前或二十年前的科普书。

像“左脑右脑”这一个大坑，可以鉴别人们是否是受过专业的认知科学训练。 这种现象非常普遍。因为人类的大脑非常善于二分法，不太习惯用全脑的思维，咱们很习惯说男左女右。可参考神经科学博士后在开智社群所讲——《左右脑的神经迷思》

人类无论进行任何一个认知操作，绝大多数时候都要动用全脑，比如数学计算是一个偏理性的操作，但是实际上它也需要动用自主心智，像1+1=2就来自于自主心智的这一部分，是你在十多年前习得的，你不需要再重新学习和思考这个知识。绝大多数左脑右脑的划分都是瞎扯。

绝大多数畅销书没有价值。很多人有一个误区，以为结果是正确的，（来源错误一些没有关系。）但是这本书不仅理论基础错误，结果也是错误的，这就是为什么绝大多数畅销书没有价值的一个根本的原因。

大家辨别这一种书有一个特别简单的技巧，真正的神作级别的书，会呈现出一个非常错综复杂的结构，不会让你非常简单地从目录中猜出来它表达的意思。但是一旦你真正进入它的文本，去阅读它，你会完全给它迷住。这就是一流的好书普遍具备的一个能力。 神书举例：《[迷楼](https://book.douban.com/subject/25774969/)》 宇文所安著。 这本书用诗歌和欲望讲这个迷宫，相当于男女之间的情爱。文字优美，令人自叹不如。

大家未来会看到绝大多数的图书，先给了一个命题，然后就一二三地来回答，这样的书百分之七八十是坏书，大家不用去浪费时间去看它，即便是想要批判性地吸收，也是一种浪费时间。

【坏书举例一】：《全新思维》　作者丹尼·平克 它的依据的理论错了，结果也错，只是这一种错误你很难辨别出来。比如说设计感、故事力、交响能力、共情能力、娱乐感，这种框架是畅销书作家编的框架，这种框架是没有多少实证证据的，更多是浪费时间。

【坏书举例二】：《驱动力》作者丹尼·平克 《驱动力》这一本书，当时他是把自我决定论的三种需求给去掉其中一种，换成自己的一个叫【驱动力2.0】的版本。这样作为一名不知道自我决定论的一位心理学爱好者，你看到这一本书之后你非常容易以为【动机3.0】就是这个版本，就会上当受骗，并且这一种上当受骗是隐藏得特别深，绝大多数人是猜不出来的。

8. Q：如何记录学习笔记和吸收课程内容？

> 想和大家探讨一下，如何更好地记录学习笔记与吸收课程内容？ 发现不仅是自己，自己小组内的小伙伴也有一种跟不上进度，吸收不了课程的压力。 为了避免自己在捐学费的道路上渐行渐远，希望能向大家学习。
> 
> 因为时间有限，现在采用的是刷视频+写大作业的模式。 每周快速刷完视频，隔天想要来写笔记时，发觉看过的内容基本全都忘记了... 到写大作业的时候，发现本周学过的内容在大脑里只剩下只言片语，完全不知道该如何运用上去，写作还是习惯性的会采用以前的模式。 所以刷视频+写大作业的模式虽然减轻了我的跟上课程进度的负担，但是好像自己并没有真正吸收和消化什么。

A：这个问题[issue#91](https://github.com/OpenMindClub/Writer002/issues/91)，同学的讨论非常精彩，直接看评论都非常好，大家把很多细节都讲明白了。 如何更好地记录学习笔记，还可以看一下第三周同学的学习笔记。

课程内容的知识点，一百到两百个专业术语，不需要把所有的知识点都消化成自己的知识点，最好挑自己最有感觉的反复练习。介绍两位同学的笔记，他们俩的学习进度比其他同学要更落后，但是他们学习的笔记写的太好了，他就是按照自己的节奏在走，他比同学普遍落后就是一周到两周左右，但是他们每一篇笔记是真的消化成自己的了。

[陈泳汀/Chloeinjoy](https://github.com/Chloeinjoy/BookWriter002)

[许豆浆/xudoujiang](https://github.com/xudoujiang/BookWriter002)

---------------------------------------------------------------------------------------------------------

Code file Writer002/IdxWritingMasters.md

附录：
####关于评判作家和文章的标准

Q：如何评价张爱玲？

> 张爱玲是不是超一流作家？之前没读张爱玲的作品。现在配合视频讲解，看过三遍《红玫瑰与白玫瑰》，感到字句上有一些趣味、巧思，但整体上读着阴冷、扭曲。个人认为不及沈从文、汪曾祺。这好比清朝家具局部看巧夺天工，但不及明朝家具大巧若拙，浑自天成。这个可能和审美有关。

A: 在一期有一个同学提了一个类似的问题——阳老师讲张爱玲讲得这么多，担心自己写的文章未来像张爱玲怎么办？我说你这个叫瞎操心，假如说是你能真正地学到了张爱玲的优点了，那简直是好得不行了，所以一点是大家不用瞎操心。

还有一个同学是周珍同学，她觉得她实在是难以接受张爱玲，她觉得她看张爱玲看得太腻了，我估计她是那种女汉子性格吧，所以她看张爱玲的这个她看不进去，这一个是很正常的一个现象，每一个人的审美会有一定的差异。所以说这个时候大家看张爱玲看得腻的话，可以看一下钱钟书，还有鲁迅这样的超一流作家。

用**数量**与**创新程度**评价张爱玲

沈从文和汪曾祺也是一流作家，只是离张爱玲会有一点点差距。这一个评判的标准其实并不是夏志清一个人所说的，其实大家可以简单地是来做一个计算的工作吧。

一般来讲评价一个作家，不要拿他写的比较水的文章来评价，而是拿他写得最好的文章来评价，你拿作家写的水的文章来评价，对作家特别不公平。拿沈从文和张爱玲来对比，他们写的最好的文章，在数量和质量上是有差异的。数量上显然是张爱玲秒杀沈从文，沈从文很多作品都是他的早年的作品，到了他晚年很多作品，其实很难对比了。一个是数量上的对比，另一个就是咱们认知写作学已经提到很多例子，这种例子都是可以用具体的指标来衡量的。举个简单例子，比如说是联想和比喻的这一个创新程度。比如说张爱玲的比喻，她非常善于写出来别人不会写的那一种比喻。钱钟书这种例子也非常多，反过来你去看沈从文的文集，这样的例子其实不太多。

Q: 评判文章是否存在客观标准？

> 评判文章，是否存在客观标准？还是仁者见仁智者见智。如，夏志清只是一家之言。如果存在，那么具体标准究竟是什么？这个标准与文章用途是否相关？比如，散文、小说、诗歌、科技论文遵从不同标准？至于Gopen指数，只是辅助工具。

A：简单地来说是文无第一，评判文章不存在客观的标准，只是大家可以要明白就是你在学任何一个东西的时候，你先是**接受对方的偏见**，这样你才能够更好地学到对方的东西。

比如阳老师他是倾向于张爱玲和夏志清和沈从文这样的作家，那么有一些人他有可能不喜欢这样的作家，当然不能说是谁对谁错，只是你在跟阳老师学习认知写作学的时候，你先是更好地学习的方法是先相信这个老师的偏见。安替的那一个演讲讲得非常好，绝大多数人学习总是叫带批判性的思维和批判性的思考，你这一种带批判性的思维和思考，它会带来两个弊端，第一个弊端是你和导师无法建立一个信任关系，最后你只能是自己闷头学。第二个弊端就是说你对对方的偏见还不了解的前提之下，你盲目地提出自己的体系，你自己又不具体提出体系的这种能力，最后这一个事情就变成一团泥坑了，这个时候你发现你会越来越乱。反过来就是那一种能够提出自己体系的人，比如说像夏志清这样的人，他对自己的偏见都有平衡的方法。

夏志清大家都知道，他首先发现钱钟书，第一个发现张爱玲，他比别人更敏锐地意识到张爱玲和钱钟书的厉害之处。那么阳老师假如要学到夏志清的优点，显然是无条件相信他的审美观点，所以我当时是把夏志清的像《中国现代小说史》和《文学及人学》，还有他的很多书都买来了，我是无条件相信他的偏见，我并不会去质疑夏志清。

夏志清当然有一些平衡他自己偏见的方法，这是任何一个大牛他所具备的一种才能。比如说他有可能对张爱玲这一个是叫十分喜爱，对其他的作家吧，比说对冰心这样的作家有可能是一分喜爱，那么我先接受他这种偏见，相信他这种偏见，这样它对我的好处会大于坏处。

【补充】安替老师这段话很值得大家琢磨：

> 偏见是自己有平衡方法的，人必须有深度，其次才谈有没有偏见，一个没有偏见又没有深度的人是没有意义的人，一个有偏见但是有深度的人是有价值的人，首先要做到有深度然后再没有偏见。

Q：如何评价诗歌？

> 日暮乡关何处是？烟波江上使人愁。曲终人不见，江上数峰青。第一句把“愁”明确点出来，第二句则没有，只是弥漫一种感觉。如果强分高下，似乎后者高一点？

A：像小说、诗歌这样的文章，它的评分的标准其实更复杂，更困难。阳老师所带的写匠团队，正在发展出一些更好的公式和思路，来计算不同文体，它所依据的就是一些客观标准。这个工作目前进行的还比较的顺利，大家有可能差不多是在6月份的时候会看到咱们的评分的标准会更准确，简单的来说这一个客观的评分标准一定不能依赖语料库，一旦依赖语料库，就会出来评分就被同学调戏了，有一个同学就是拿张爱玲的几篇文章测试了一下，发现张爱玲有的文章是可以达到92分，有的文章是达到一个是30多分。

Q：英文和中文的差异

A：在平克看来，英文写作应追求classic style。对于中文，阳老师认为学习写作的目标是什么？认知写作课的训练目标是否是写作向张爱玲等靠拢？或者分层次讨论，在篇章、段落、词句上的理想写作风格、标准是什么？能否举例说明。
取西方之简洁，承中文抒情之美

恰巧是我今天下午刚刚讲的这个问题，就是拿平克举例。中文的写作和西方的写作会存在一个差异，因为西方的写作，它的词汇量和中文的词汇量不太一样，信息密度也不太一样。所以说西方的写作无论是平克和保罗（硅谷创业教父），他们推崇的都是这一个风格。而这一种风格最大的特点就是什么呢？它是相当于是比较朴实的，用朴实语言的方式表达出来，保罗写了一篇文章是叫《如何学习写作》那篇文章中他对这种风格有一些详细的介绍，平克他也推崇的这个风格的一本书。

但是大家要特别的注意，中文的写作，用英文的写作风格来写，就你会发现你的文章写的是跟白开水差不多，就是因为咱们中文的特点和英文的特点非常的不一样，中文的特点是叙事性不太强，抒情性会比较强。你用这种自己的弱点来写西方的优点，结果你会发现你的文章故事性更差，文采更差。所以说就是咱们是从这一个平克和保罗身上学的是什么呢？学的是让文章变的简洁，但是还要是从自己中文的优秀的传统去学习像张爱玲，像钱钟书他们的一些写法，这种写法就是他是利用了中文的一些特点。

关于中文写作的美文规范版，我大概开列了一个清单，这就是现在评你文章的一个语料库来源，大概有100多位作家，排名前十的名单如下：

1.钱钟书 
2.张爱玲 
3.夏志清 
4.沈从文
5.汪曾祺
6.痖弦 
7.张定浩
8.钱歌川
9.王佐良
10.查良铮
